*Based on kaggle tutorials https://www.kaggle.com/*

In [ ]:
# Imports
import pandas as pd

## Question 1

 - Υπολογίστε τον συνολικό αριθμό των δευτερολέπτων σε 4 χρόνια έτος.

In [ ]:
# Create variables
num_years = ____
days_per_year = ____
hours_per_day = ____
mins_per_hour = ____
secs_per_min = ____

# Calculate number of seconds in four years
total_secs = ____

 - Ορίστε μια μεταβλητή `births_per_min` και ορίστε την σε 267. (Υπάρχουν κατά μέσο όρο 267 μωρά που γεννιούνται κάθε λεπτό.)
 - Ορίστε μια μεταβλητή `births_per_day` που περιέχει τον μέσο αριθμό μωρών που γεννιούνται κάθε μέρα.

## 🌶️ Question 2

Εκτελέστε το επόμενο κελί κώδικα χωρίς αλλαγές για να φορτώσετε και να κάνετε προεπισκόπηση των δεδομένων.

In [2]:
# Load the data 
import pandas as pd
titanic_data = pd.read_csv("data/titanic.csv")


# Show the first five rows of the data
titanic_data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [18]:
classes = titanic_data["Pclass"].unique()
print(classes)

[3 1 2]

In [14]:
third_class_passengers = (titanic_data.Pclass == 3).sum()
print(third_class_passengers)

491

Τα δεδομένα έχουν διαφορετική σειρά για κάθε επιβάτη.

Το επόμενο κελί κώδικα ορίζει και εκτυπώνει τις τιμές τριών μεταβλητών:

 - `total` = συνολικός αριθμός επιβατών που επιβιβάστηκαν στο πλοίο
 - `survived` = αριθμός επιβατών που επέζησαν από το ναυάγιο
 - `minors` = αριθμός επιβατών κάτω των 18 ετών

In [9]:
survived = (titanic_data.Survived == 1).sum()
survived

342

In [20]:
# Number of total passengers
total = len(titanic_data)
print(total)

# Number of passengers who survived
survived = (titanic_data.Survived == 1).sum()
print(survived)

# Number of passengers under 18
minors = (titanic_data.Age < 18).sum()
print(minors)

891
342
113

Στο παρακάτω κελί κώδικα, αντικαταστήστε τις υπογραμμίσεις (____) με κώδικα για να υπολογίσετε τις τιμές για δύο ακόμη μεταβλητές:

 - `surved_fraction` θα πρέπει να οριστεί το κλάσμα των επιβατών που επέζησαν από την καταστροφή του Τιτανικού.
 - `minors_fraction` θα πρέπει να είναι το κλάσμα των επιβατών που ήταν ανήλικοι (κάτω των 18 ετών).

In [21]:
# TODO: Fill in the value of the survived_fraction variable
survived_fraction = (survived / total)*100

# Print the value of the variable
print(survived_fraction)

# TODO: Fill in the value of the minors_fraction variable
minors_fraction = (minors / total)*100 

# Print the value of the variable
print(minors_fraction)

38.38383838383838
12.682379349046016

In [24]:
survived_under_18 = ((titanic_data.Survived == 1) & (titanic_data.Age < 18) & (titanic_data.Sex == 'male')).sum()